#### Terraform Format and Style 🖌`failure`
#### perf - Terraform Initialization ⚙️`success`
#### perf - Terraform Validation 🤖Success! The configuration is valid.


#### perf - Terraform Plan 📖`success`

<details><summary>perf - Show Plan</summary>

```terraform
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=broad-jade-perf/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=broad-jade-perf/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=broad-jade-perf/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=broad-jade-perf/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=broad-jade-perf/container.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=broad-jade-perf/compute.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=broad-jade-perf/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[16]: Refreshing state... [id=broad-jade-perf/cloudkms.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=broad-jade-perf/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=broad-jade-perf/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=broad-jade-perf/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=broad-jade-perf/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=broad-jade-perf/logging.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=broad-jade-perf/dns.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=broad-jade-perf/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=broad-jade-perf/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=broad-jade-perf/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=broad-jade-perf/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=broad-jade-perf/storage-component.googleapis.com]
module.core-infrastructure.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-jade-perf/managedZones/datarepo-perf]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/broad-jade-perf/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_kms_key_ring.db: Refreshing state... [id=projects/broad-jade-perf/locations/us-central1/keyRings/jade-db]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_service_account.node_pool: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/broad-jade-perf/global/networks/perf-network]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/broad-jade-perf/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_project_iam_member.node_pool[3]: Refreshing state... [id=broad-jade-perf/roles/container.admin/serviceaccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[4]: Refreshing state... [id=broad-jade-perf/roles/compute.admin/serviceaccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[5]: Refreshing state... [id=broad-jade-perf/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[0]: Refreshing state... [id=broad-jade-perf/roles/monitoring.viewer/serviceaccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[1]: Refreshing state... [id=broad-jade-perf/roles/monitoring.metricWriter/serviceaccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[2]: Refreshing state... [id=broad-jade-perf/roles/logging.logWriter/serviceaccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_crypto_key.db: Refreshing state... [id=projects/broad-jade-perf/locations/us-central1/keyRings/jade-db/cryptoKeys/jade]
module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access: Refreshing state... [id=broad-jade-perf/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/subnetworks/perf-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/broad-jade-perf/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=broad-jade-perf/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/broad-jade-perf/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=XVBZlc9f-z80-ZpLNO5jsw]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=aNMSBLCABzYH2zvi4gyTig]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=nYzXs8nUU2U]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.sql_workloadid.google_service_account.service-account: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-sqlproxy@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=j1pP7_dXMAel-yE6ppQsGg]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/broad-jade-perf/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/broad-jade-perf/global/addresses/jade-perf-ip]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=broad-jade-perf/roles/bigquery.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=broad-jade-perf/roles/pubsub.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[0]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.folderAdmin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[1]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.projectCreator/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[2]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.projectDeleter/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=broad-jade-perf/roles/container.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=broad-jade-perf/roles/logging.logWriter/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=broad-jade-perf/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=broad-jade-perf/roles/monitoring.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=broad-jade-perf/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=broad-jade-perf/roles/datastore.user/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=broad-jade-perf/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=broad-jade-perf/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=broad-jade-perf/roles/storage.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=broad-jade-perf/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com/keys/89af255c61dee30f0a6f1c490beace331479f1aa]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com/keys/dc9c1cafa59b58166045e973d2e791b8a3f4dde7]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=broad-jade-perf/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=broad-jade-perf/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=broad-jade-perf/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=broad-jade-perf/roles/container.admin/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.sql_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-sqlproxy@broad-jade-perf.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.module.sql_workloadid.google_project_iam_member.service-account-role["roles/cloudsql.client"]: Refreshing state... [id=broad-jade-perf/roles/cloudsql.client/serviceaccount:datarepo-jade-sqlproxy@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_dns_record_set.a_dns[0]: Refreshing state... [id=datarepo-perf/jade-perf-global.datarepo-perf.broadinstitute.org./A]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fbroad-jade-perf%2Fglobal%2Fnetworks%2Fperf-network:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/perf/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/perf/test-runner-sa]
module.datarepo-app.google_dns_record_set.cname_dns[0]: Refreshing state... [id=datarepo-perf/jade-perf.datarepo-perf.broadinstitute.org./CNAME]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/broad-jade-perf/instances/datarepo-db-jade-9d8cd7b3c9d45365/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/broad-jade-perf/instances/datarepo-db-jade-9d8cd7b3c9d45365/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/perf/datarepo-sql-db]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/broad-jade-perf/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/broad-jade-perf/uptimeCheckConfigs/jade-perf-datarepo-perf-broadinstitute-org]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/broad-jade-perf/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/broad-jade-perf/notificationChannels/3869773518729165502]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/18153599214970417824]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/3837205474008382607]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/1124096916984786439]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=broad-jade-perf/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=broad-jade-perf/roles/logging.admin/serviceaccount:prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/prometheus-sa@broad-jade-perf.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=broad-jade-perf/roles/monitoring.admin/serviceaccount:prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.google_dns_record_set.prometheus_a_dns[0]: Refreshing state... [id=datarepo-perf/datarepo-prometheus.datarepo-perf.broadinstitute.org./A]
module.datarepo-alerts.google_dns_record_set.grafana_a_dns[0]: Refreshing state... [id=datarepo-perf/datarepo-grafana.datarepo-perf.broadinstitute.org./A]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/2707639561392074623]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access will be updated in-place
  ~ resource "google_project_iam_binding" "kubernetes_engine_kms_access" {
        id      = "broad-jade-perf/roles/cloudkms.cryptoKeyEncrypterDecrypter"
      ~ members = [
          - "serviceAccount:gke-node-sa@broad-jade-perf.iam.gserviceaccount.com",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.datarepo-alerts.data.google_dns_managed_zone.dns_zone[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_dns_managed_zone" "dns_zone"  {
      ~ description  = "Managed by Terraform" -> (known after apply)
      ~ dns_name     = "datarepo-perf.broadinstitute.org." -> (known after apply)
      ~ id           = "projects/broad-jade-perf/managedZones/datarepo-perf" -> (known after apply)
        name         = "datarepo-perf"
      ~ name_servers = [
          - "ns-cloud-b1.googledomains.com.",
          - "ns-cloud-b2.googledomains.com.",
          - "ns-cloud-b3.googledomains.com.",
          - "ns-cloud-b4.googledomains.com.",
        ] -> (known after apply)
      - project      = "broad-jade-perf" -> null
      ~ visibility   = "public" -> (known after apply)
    }

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC2229" -> (known after apply)
      - version          = -1 -> null
        # (1 unchanged attribute hidden)
    }

  # module.datarepo-alerts.google_dns_record_set.grafana_a_dns[0] must be replaced
-/+ resource "google_dns_record_set" "grafana_a_dns" {
      ~ id           = "datarepo-perf/datarepo-grafana.datarepo-perf.broadinstitute.org./A" -> (known after apply)
      ~ name         = "datarepo-grafana.datarepo-perf.broadinstitute.org." -> (known after apply) # forces replacement
      ~ project      = "broad-jade-perf" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.datarepo-alerts.google_dns_record_set.prometheus_a_dns[0] must be replaced
-/+ resource "google_dns_record_set" "prometheus_a_dns" {
      ~ id           = "datarepo-perf/datarepo-prometheus.datarepo-perf.broadinstitute.org./A" -> (known after apply)
      ~ name         = "datarepo-prometheus.datarepo-perf.broadinstitute.org." -> (known after apply) # forces replacement
      ~ project      = "broad-jade-perf" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        id           = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
        name         = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
        # (6 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-app.data.google_dns_managed_zone.dns_zone[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_dns_managed_zone" "dns_zone"  {
      ~ description  = "Managed by Terraform" -> (known after apply)
      ~ dns_name     = "datarepo-perf.broadinstitute.org." -> (known after apply)
      ~ id           = "projects/broad-jade-perf/managedZones/datarepo-perf" -> (known after apply)
        name         = "datarepo-perf"
      ~ name_servers = [
          - "ns-cloud-b1.googledomains.com.",
          - "ns-cloud-b2.googledomains.com.",
          - "ns-cloud-b3.googledomains.com.",
          - "ns-cloud-b4.googledomains.com.",
        ] -> (known after apply)
      - project      = "broad-jade-perf" -> null
      ~ visibility   = "public" -> (known after apply)
    }

  # module.datarepo-app.google_dns_record_set.a_dns[0] must be replaced
+/- resource "google_dns_record_set" "a_dns" {
      ~ id           = "datarepo-perf/jade-perf-global.datarepo-perf.broadinstitute.org./A" -> (known after apply)
      ~ name         = "jade-perf-global.datarepo-perf.broadinstitute.org." -> (known after apply) # forces replacement
      ~ project      = "broad-jade-perf" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.datarepo-app.google_dns_record_set.cname_dns[0] must be replaced
+/- resource "google_dns_record_set" "cname_dns" {
      ~ id           = "datarepo-perf/jade-perf.datarepo-perf.broadinstitute.org./CNAME" -> (known after apply)
      ~ name         = "jade-perf.datarepo-perf.broadinstitute.org." -> (known after apply) # forces replacement
      ~ project      = "broad-jade-perf" -> (known after apply)
      ~ rrdatas      = [
          - "jade-perf-global.datarepo-perf.broadinstitute.org.",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.datarepo-app.google_folder_iam_member.app_folder_roles[3] will be created
  + resource "google_folder_iam_member" "app_folder_roles" {
      + etag   = (known after apply)
      + folder = "270278425081"
      + id     = (known after apply)
      + member = "serviceAccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com"
      + role   = "roles/owner"
    }

Plan: 5 to add, 2 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @samanehsan, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*